StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
	return dma_ch;
}

/**
 * this function will return total trx ring number of target dma channel
 * @ch_idx: input, target dma channel index
 *
 * NOTE, input host_idx and hw_idx ptr shall NOT be NULL
 */
static int hal_get_trxring_num_8730ea(struct rtw_hal_com_t *hal_com, u8 ch_idx)
{
	int ring_num = 0;

	switch (ch_idx) {
	case MGT_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_MGQ;
		break;
	case RX_QUEUE_IDX_8730EA:
		ring_num = RX_BD_NUM_8730EA;
		break;
	case VO_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_VOQ;
		break;
	case VI_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_VIQ;
		break;
	case BE_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_BEQ;
		break;
	case BK_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_BKQ;
		break;
	case HIGH_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_H0Q;
		break;
	case TXCMD_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_CMD;
		break;
	case BCN_QUEUE_IDX_8730EA:
		ring_num = TX_BD_NUM_8730EA_BCN;
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown channel (%d)\n",
			  ch_idx);
		ring_num = 0;
		break;
	}

	return ring_num;
}

/**
 * this function will return available txbd number of target dma channel
 * @ch_idx: input, target dma channel index
 * @host_idx: the ptr of current host index of this channel
 * @hw_idx: the ptr of current hw index of this channel
 *
 * NOTE, input host_idx and hw_idx ptr shall NOT be NULL
 */
static u16 hal_get_avail_txbd_8730ea(struct rtw_hal_com_t *hal_com, u8 ch_idx,
				     u16 *host_idx, u16 *hw_idx)
{
	struct bus_cap_t *bus_cap = &hal_com->bus_cap;
	u16 avail_txbd = 0;
	u32 tmp32 = 0, reg = 0;
	u8 tx_dma_ch = 0;

	tx_dma_ch = BE_QUEUE_IDX_8730EA + ch_idx;

	reg = _hal_get_bd_idx_reg_8730ea(tx_dma_ch);
	if (0xFFFF == reg) {
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_,
			  "[WARNING]get dma channel register fail\n");
		avail_txbd = 0;
	} else {
		tmp32 = hal_read32(hal_com, reg);

		*host_idx = (u16)(tmp32 & 0x0FFF);
		*hw_idx = (u16)((tmp32 >> 16) & 0x0FFF);

		avail_txbd = hal_calc_avail_wptr(*hw_idx, *host_idx,
						 (u16)bus_cap->txbd_num);
		PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_,
			  "hal_get_avail_txbd_8730ea => dma_ch %d, host_idx %d, "
			  "hw_idx %d, avail_txbd %d\n",
			  ch_idx, *host_idx, *hw_idx, avail_txbd);
	}

	return avail_txbd;
}

/**
 * this function will return available txbd number of target dma channel
 * @ch_idx: input, target dma channel index
 * @host_idx: the ptr of current host index of this channel
 * @hw_idx: the ptr of current hw index of this channel
 *
 * NOTE, input host_idx and hw_idx ptr shall NOT be NULL
 */
static u16 hal_get_avail_rxbd_8730ea(struct rtw_hal_com_t *hal_com, u8 ch_idx,
				     u16 *host_idx, u16 *hw_idx)
{
	struct bus_cap_t *bus_cap = &hal_com->bus_cap;
	u16 avail_rxbd = 0;
	u32 tmp32 = 0, reg = 0;
	u8 rx_dma_ch = 0;

	rx_dma_ch = RX_QUEUE_IDX_8730EA + ch_idx;

	reg = _hal_get_bd_idx_reg_8730ea(rx_dma_ch);
	if (0xFFFF == reg) {
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]get dma channel register fail\n");
		avail_rxbd = 0;
	} else {
		tmp32 = hal_read32(hal_com, reg);

		*host_idx = (u16)(tmp32 & 0x0FFF);
		*hw_idx = (u16)((tmp32 >> 16) & 0x0FFF);

		avail_rxbd = hal_calc_avail_rptr(*host_idx, *hw_idx,
						 (u16)bus_cap->rxbd_num);
	}

	return avail_rxbd;
}


void _hal_fill_wp_addr_info_8730ea(struct rtw_hal_com_t *hal_com,
				   u8 *addr_info, struct rtw_pkt_buf_list *pkt,
				   u8 num, u8 mpdu_ls, u8 msdu_ls, bool lastwp)
{
	SET_ADDR_INFO_LEN(addr_info, pkt->length);
	SET_ADDR_INFO_ADDR_LOW_LSB(addr_info, pkt->phy_addr_l);

	//if (lastwp) {
	//	SET_ADDR_INFO_LS(addr_info, 1);
	//} else {
	//	SET_ADDR_INFO_LS(addr_info, 0);
	//}
}

u8 _hal_get_tid_indic_8730ea(u8 tid)
{
	u8 tid_indic = 0;
	switch (tid) {
	case RTW_PHL_RING_CAT_TID0:
	case RTW_PHL_RING_CAT_TID1:
	case RTW_PHL_RING_CAT_TID4:
	case RTW_PHL_RING_CAT_TID6:
	case RTW_PHL_RING_CAT_MGNT:
	case RTW_PHL_RING_CAT_HIQ:
		tid_indic = 0;
		break;
	case RTW_PHL_RING_CAT_TID3:
	case RTW_PHL_RING_CAT_TID2:
	case RTW_PHL_RING_CAT_TID5:
	case RTW_PHL_RING_CAT_TID7:
		tid_indic = 1;
		break;
	default:
		PHL_ERR("unknown tid %d\n", tid);
		break;
	}

	return tid_indic;
}

#ifdef CONFIG_PHL_TXSC

static u8 qsel_tbl[] = {
	TID_0_QSEL/*0*/, TID_1_QSEL/*1*/, TID_2_QSEL/*1*/, TID_3_QSEL/*0*/,
	TID_4_QSEL/*2*/, TID_5_QSEL/*2*/, TID_6_QSEL/*3*/, TID_7_QSEL/*2*/
};

static u8 tid_ind[] = {
	TID_0_IND, TID_1_IND, TID_2_IND, TID_3_IND,
	TID_4_IND, TID_5_IND, TID_6_IND, TID_7_IND
};

static enum rtw_hal_status
_hal_txsc_update_wd(struct hal_info_t *hal,
		    struct rtw_phl_pkt_req *req, u32 *wd_len) {
	struct rtw_xmit_req *tx_req = req ? req->tx_req : NULL;
	struct rtw_t_meta_data	*mdata;
	u32 *wd_words;
	u32 w0, w2, w3, w8, w9;

	if (NULL == tx_req)
	{
		return RTW_HAL_STATUS_FAILURE;
	}

	if (req->wd_len == 0)
	{
		rtw_hal_mac_ax_fill_txdesc(hal->mac, tx_req, req->wd_page,
					   wd_len);
		req->wd_len = (u8) * wd_len;
	} else
	{
		mdata = &tx_req->mdata;
		mdata->dma_ch = hal_mapping_hw_tx_chnl_8730ea(mdata->macid, mdata->tid, mdata->band);

		wd_words = (u32 *)req->wd_page;
		w0 = le32_to_cpu(wd_words[0])
		& ~(AX_TXD_TXPKTSIZE_MSK << AX_TXD_TXPKTSIZE_SH);
		w2 = le32_to_cpu(wd_words[2])
		& ~((AX_TXD_QSEL_MSK << AX_TXD_QSEL_SH)
		    | (AX_TXD_AGG_EN | AX_TXD_BK));
		w3 = le32_to_cpu(wd_words[3])
		& ~(AX_TXD_HW_SSN_SEL_MSK << AX_TXD_HW_SSN_SEL_SH);
		w8 = le32_to_cpu(wd_words[8])
		& ~(AX_TXD_EN_HWSEQ);
		w9 = le32_to_cpu(wd_words[3])
		& ~(AX_TXD_SEQ_MSK << AX_TXD_SEQ_SH);

		/* Update SSN SEL, DMA CH, QSEL, and TID indicator in WD cache */
		w0 |= (mdata->pktlen & AX_TXD_TXPKTSIZE_MSK) << AX_TXD_TXPKTSIZE_SH;
		wd_words[0] = cpu_to_le32(w0);

		if (mdata->hw_seq_mode == 0) {
			w9 |= (mdata->sw_seq & AX_TXD_HW_SSN_SEL_MSK) << AX_TXD_HW_SSN_SEL_SH;
			wd_words[9] = cpu_to_le32(w9);
		} else {
			w8 |= AX_TXD_EN_HWSEQ;
			wd_words[8] = cpu_to_le32(w8);
		}

		w3 |= (mdata->hw_ssn_sel & AX_TXD_HW_SSN_SEL_MSK) << AX_TXD_HW_SSN_SEL_SH;
		wd_words[3] = cpu_to_le32(w3);

		if (mdata->ampdu_en) {
			w2 |= AX_TXD_AGG_EN;
		}

