StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
		PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_,
			  "hal_trigger_txdma_8730ea => dma_ch %d, host_idx %d.\n",
			  ch_idx, txbd_ring[ch_idx].host_idx);
		hal_write16(hal->hal_com, txbd_reg, txbd_ring[ch_idx].host_idx);
		hstatus = RTW_HAL_STATUS_SUCCESS;
	} while (false);

	return hstatus;
}

static enum rtw_hal_status hal_pltfm_tx_8730ea(void *hal, struct rtw_h2c_pkt *h2c_pkt)
{
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
#if 0

	struct hal_info_t *hal_info = (struct hal_info_t *)hal;
	struct rtw_wd_page wd_page;
	struct tx_base_desc *txbd_ring = NULL;

	_os_mem_set(hal_to_drvpriv(hal_info), &wd_page, 0, sizeof(wd_page));

	txbd_ring = (struct tx_base_desc *)hal_info->hal_com->fw_txbd;
	wd_page.vir_addr = h2c_pkt->vir_addr;
	wd_page.phy_addr_l = h2c_pkt->phy_addr_l;
	wd_page.phy_addr_h = h2c_pkt->phy_addr_h;
	wd_page.buf_len = h2c_pkt->buf_len;
	wd_page.cache = 1;

	_os_spinlock(hal_to_drvpriv(hal_info), &txbd_ring[FWCMD_QUEUE_IDX_8730EA].txbd_lock, _ps, NULL);
	hstatus = hal_update_txbd_8730ea(hal_info, txbd_ring, &wd_page,
					 FWCMD_QUEUE_IDX_8730EA, 1);
	_os_spinunlock(hal_to_drvpriv(hal_info), &txbd_ring[FWCMD_QUEUE_IDX_8730EA].txbd_lock, _ps, NULL);

	/* enqueue busy queue */

	hstatus = hal_trigger_txdma_8730ea(hal_info, txbd_ring, FWCMD_QUEUE_IDX_8730EA);
#endif
	return hstatus;
}

static u8 hal_check_rxrdy_8730ea(struct rtw_phl_com_t *phl_com, u8 *rxbd_info,
				 u8 ch_idx)
{
	struct hal_spec_t *hal_spec = &phl_com->hal_spec;
	u8 res = true;
	u8 first_seg = 0, last_seg = 0;
	u16 total_len = 0, read_cnt = 0;
	do {
		if (rxbd_info == NULL) {
			PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_,
				  "[WARNING] input rx bd info is NULL!\n");
			res = false;
			break;
		}

		total_len = (u16)GET_RX_BD_INFO_TOTALRXPKTSIZE(rxbd_info);
		first_seg = (u8)GET_RX_BD_INFO_FS(rxbd_info);
		last_seg = (u8)GET_RX_BD_INFO_LS(rxbd_info);

		while (total_len == 0) {
			read_cnt++;

			total_len = (u16)GET_RX_BD_INFO_TOTALRXPKTSIZE(rxbd_info);
			first_seg = (u8)GET_RX_BD_INFO_FS(rxbd_info);
			last_seg = (u8)GET_RX_BD_INFO_LS(rxbd_info);

			if (read_cnt > 10000) {
				res = false;
				break;
			}
		}

		PHL_TRACE(COMP_PHL_DBG, _PHL_DEBUG_, "RX:%s exit total_len=%d, rx_tag = %d, first_seg=%d, last_seg=%d, read_cnt %d\n",
			  __func__, total_len, hal_spec->rx_tag[ch_idx],
			  first_seg, last_seg, read_cnt);

	} while (false);

	return res;
}

static void _hal_show_tx_failure_rsn_8730ea(u8 txsts)
{

	switch (txsts) {

	case TX_STATUS_TX_FAIL_REACH_RTY_LMT:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (REACH_RTY_LMT)\n");
		break;
	case TX_STATUS_TX_FAIL_LIFETIME_DROP:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (LIFETIME_DROP)\n");
		break;
	case TX_STATUS_TX_FAIL_MACID_DROP:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (MACID_DROP)\n");
		break;
	case TX_STATUS_TX_FAIL_SW_DROP:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (SW_DROP)\n");
		break;
	default:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (UNKNOWN)\n");
		break;
	}

}

/**
 * Process Rx PPDU Status with HALMAC API and PHYDM API
 */
static enum rtw_hal_status
hal_handle_ppdusts_8730ea(void *hal, u8 *psbuf, u16 sz,
			  struct rtw_r_meta_data *mdata, struct rx_ppdu_status *rxps) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;

	if (mdata->mac_info_vld)
	{
		/*Call HALMAC API HALMAC API*/
		rxps->mac_info_length = 4; //To DO
	}

	rxps->phy_info_length = sz - rxps->mac_info_length;
	if (rxps->phy_info_length > 0)
	{
		/* the remaining length > 4  the phy info is valid */
		/* CALL PHYDM API Here*/
		//rx_desc->mac_id

	}
	hstatus = RTW_HAL_STATUS_SUCCESS;
	return hstatus;
}

/**
 * SW Parsing Rx Desc
 **/
static enum rtw_hal_status
_hal_parsing_rx_wd_8730ea(struct hal_info_t *hal, u8 *desc,
			  struct rtw_r_meta_data *mdata) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;

	hstatus = RTW_HAL_STATUS_SUCCESS;
	return hstatus;
}

static u8 hal_handle_rxbd_info_8730ea(struct hal_info_t *hal,
				      u8 *rxbd_info, u16 *size)
{
	u8 res = false;
	u16 pld_size = 0;
	u8 fs = 0, ls = 0;
	u8 pkt_rdy = false;

	do {
		if (NULL == rxbd_info) {
			break;
		}
		if (NULL == size) {
			break;
		}

		fs = (u8)GET_RX_BD_INFO_FS(rxbd_info);
		ls = (u8)GET_RX_BD_INFO_LS(rxbd_info);
		pld_size = (u16)GET_RX_BD_INFO_HW_W_SIZE(rxbd_info);

		if (fs == 1) {
			if (ls == 1) {
				pkt_rdy = true;
			} else {
				pkt_rdy = false;
			}

		} else if (fs == 0) {
			if (ls == 1) {
				pkt_rdy = false;
			} else {
				pkt_rdy = false;
			}
		}

		if (pkt_rdy) {
			*size = pld_size;
			res = true;
		} else {
			*size = 0;
			PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING] need to handle RX FS/LS\n");
			res = false;
		}
	} while (false);
	return res;
}



/**
 * the function update rxbd
 */
static enum rtw_hal_status
hal_update_rxbd_8730ea(struct hal_info_t *hal, struct rx_base_desc *rxbd,
		       struct rtw_rx_buf *rx_buf) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	struct bus_hw_cap_t *bus_hw_cap = &hal_com->bus_hw_cap;
	u8 *ring_head = NULL;
	u8 *target_rxbd = NULL;
	u16 rxbd_num = (u16)hal_com->bus_cap.rxbd_num;

	do
	{
		if (NULL == rxbd) {
			break;
		}
		if (NULL == rx_buf) {
			break;
		}

		ring_head = rxbd->vir_addr;
		target_rxbd = ring_head + (rxbd->host_idx *
					   bus_hw_cap->rxbd_len);
		/* connect with halmac */
		SET_RX_BD_INFO_FS(target_rxbd, 0);
		SET_RX_BD_INFO_LS(target_rxbd, 0);
		SET_RX_BD_RXBUFFSIZE(target_rxbd, rx_buf->buf_len);
		SET_RX_BD_PHYSICAL_ADDR_LOW(target_rxbd,
					    (u32)rx_buf->phy_addr_l);

		rxbd->host_idx = (rxbd->host_idx + 1) % rxbd_num;
	} while (false);

	return hstatus;
}


/**
 * the function notify rx done
 */
static enum rtw_hal_status
hal_notify_rxdone_8730ea(struct hal_info_t *hal,
			 struct rx_base_desc *rxbd, u8 ch, u16 rxcnt) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;
	u32 reg = 0;
	u8 rx_dma_ch = 0;

	do
	{
		rx_dma_ch = RX_QUEUE_IDX_8730EA + ch;
		reg = _hal_get_bd_idx_reg_8730ea(rx_dma_ch);
		/* connect with halmac */
		if (0xFFFF == reg) {
			break;
		}
		hal_write16(hal->hal_com, reg, rxbd->host_idx);
		hstatus = RTW_HAL_STATUS_SUCCESS;
	} while (false);

	return hstatus;
}

static void _hal_trx_init_bd_num_8730ea(struct hal_info_t *hal)
{
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	u16 txbd_num = (u16)hal_com->bus_cap.txbd_num;
	u16 rxbd_num = (u16)hal_com->bus_cap.rxbd_num;
	u32 reg = 0;
	u16 value = 0;
	u8 i = 0;

	for (i = 0; i < TX_DMA_CHANNEL_ENTRY_8730EA; i++) {
		if ((TXCMD_QUEUE_IDX_8730EA == i) \
		    || (BCN_QUEUE_IDX_8730EA == i)) {
			continue;
		}


