StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
		value = ((RTL8730AE_SEG_NUM & 0x3) << 12)
			| (txbd_num & 0x3F);

		reg = _hal_get_bd_num_reg_8730ea(i);
		if (0 != reg) {
			hal_write16(hal->hal_com, reg, value);
		} else {
			PHL_ERR("query txbd num reg fail (ch_idx = %d)\n", i);
		}
	}

	value = ((RTL8730AE_SEG_NUM & 0x3) << 12)
		| (rxbd_num & 0x3F);

	reg = _hal_get_bd_num_reg_8730ea(RX_QUEUE_IDX_8730EA);
	if (0 != reg) {
		hal_write16(hal->hal_com, reg, value);
	} else {
		PHL_ERR("query rxbd num reg fail (ch_idx = %d)\n",\
			RX_QUEUE_IDX_8730EA);
	}

	hal_write32(hal->hal_com, REG_BD_RWPTR_CLR, 0xFFFFFFFF);
}


static void _hal_trx_init_bd_8730ea(struct hal_info_t *hal, u8 *txbd_buf, u8 *rxbd_buf)
{
	struct tx_base_desc *txbd = NULL;
	struct rx_base_desc *rxbd = NULL;
	u32 reg_addr_l = 0, reg_addr_h = 0, value32 = 0;
	u8 i = 0, rxch_idx = 0;

	/* Disable Stop RX DMA */
	value32 = hal_read32(hal->hal_com, REG_AXI_CTRL);
	value32 &= ~BIT_STOPRX;
	hal_write32(hal->hal_com, REG_AXI_CTRL, value32);

	/* Clear the pending ISR */
	hal_write32(hal->hal_com, REG_AXI_INTERRUPT, 0xFFFFFFFF);

	if (NULL != txbd_buf && NULL != rxbd_buf) {
		txbd = (struct tx_base_desc *)txbd_buf;
		rxbd = (struct rx_base_desc *)rxbd_buf;

		/* data queue + mgnt queue + high queue */
		for (i = 0; i < TX_DMA_CHANNEL_ENTRY_8730EA; i++) {
			if ((TXCMD_QUEUE_IDX_8730EA == i) \
			    || (BCN_QUEUE_IDX_8730EA == i)) {
				continue;
			}

			switch (i) {
			case MGT_QUEUE_IDX_8730EA:
				value32 = BIT_MGQDESA(txbd[i].phy_addr_l);
				break;
			case VO_QUEUE_IDX_8730EA:
				value32 = BIT_VOQDESA(txbd[i].phy_addr_l);
				break;
			case VI_QUEUE_IDX_8730EA:
				value32 = BIT_VIQDESA(txbd[i].phy_addr_l);
				break;
			case BE_QUEUE_IDX_8730EA:
				value32 = BIT_BEQDESA(txbd[i].phy_addr_l);
				break;
			case BK_QUEUE_IDX_8730EA:
				value32 = BIT_BKQDESA(txbd[i].phy_addr_l);
				break;
			case HIGH_QUEUE_IDX_8730EA:
				value32 = BIT_MQ0DESA(txbd[i].phy_addr_l);
				break;
			default:
				PHL_ERR("not support channel (ch_idx = %d)\n", i);
				break;
			}

			_hal_get_bd_desc_reg_8730ea(i, &reg_addr_l, &reg_addr_h);
			if (0 != reg_addr_l) {
				hal_write32(hal->hal_com, reg_addr_l, value32);
			} else {
				PHL_ERR("query txbd desc reg_addr_l fail (ch_idx = %d)\n", i);
			}
		}

		/* beacon queue */
		value32 = BIT_BPQDESA(txbd[BCN_QUEUE_IDX_8730EA].phy_addr_l);
		_hal_get_bd_desc_reg_8730ea(BCN_QUEUE_IDX_8730EA, &reg_addr_l, &reg_addr_h);
		if (0 != reg_addr_l) {
			hal_write32(hal->hal_com, reg_addr_l, value32);
		} else {
			PHL_ERR("query txbd desc reg_addr_l fail (bcn queue)\n");
		}

		/* RX queue */
		value32 = BIT_RXNRML_DESA(rxbd[rxch_idx].phy_addr_l);
		_hal_get_bd_desc_reg_8730ea(RX_QUEUE_IDX_8730EA, &reg_addr_l, &reg_addr_h);
		if (0 != reg_addr_l) {
			hal_write32(hal->hal_com, reg_addr_l, value32);
		} else {
			PHL_ERR("query rxbd desc reg_addr_l fail (ch_idx = %d)\n", i);
		}
	}

	value32 = hal_read32(hal->hal_com, REG_AXI_CTRL);
	value32 |= BIT_MAX_RXDMA(0x03) | BIT_MAX_TXDMA(0x03);
	/* enable total packet length int rxbd[16:31] */
	value32 &= ~BIT_EN_WT_RXTAG;
	hal_write32(hal->hal_com, REG_AXI_CTRL, value32);
}

static void hal_cfg_wow_txdma_8730ea(struct hal_info_t *hal, u8 en)
{

}
static u8 hal_poll_txdma_idle_8730ea(struct hal_info_t *hal)
{
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	struct rtw_phl_com_t *phl_com = hal->phl_com;
	struct bus_cap_t *bus_cap = &hal_com->bus_cap;
	u16 avail_txbd = 0;
	u16  host_idx[HIGH_QUEUE_IDX_8730EA + 1] = {0}, hw_idx[HIGH_QUEUE_IDX_8730EA + 1] = {0};
	u8 ch = 0;
	u32 i = 0;
	u8 ret = false;
#define TXDMA_IDLE_CNT (1000)

	while (i < TXDMA_IDLE_CNT) {
		for (ch = BE_QUEUE_IDX_8730EA; ch <= HIGH_QUEUE_IDX_8730EA; ch++) {
			avail_txbd = hal_get_avail_txbd_8730ea(hal_com, ch, &host_idx[ch], &hw_idx[ch]);
		}
		_os_delay_us(phl_com->drv_priv, 1);
		if ((host_idx[BE_QUEUE_IDX_8730EA] == hw_idx[BE_QUEUE_IDX_8730EA])
		    && (host_idx[BK_QUEUE_IDX_8730EA] == hw_idx[BK_QUEUE_IDX_8730EA])
		    && (host_idx[VI_QUEUE_IDX_8730EA] == hw_idx[VI_QUEUE_IDX_8730EA])
		    && (host_idx[VO_QUEUE_IDX_8730EA] == hw_idx[VO_QUEUE_IDX_8730EA])
		    && (host_idx[MGT_QUEUE_IDX_8730EA] == hw_idx[MGT_QUEUE_IDX_8730EA])
		    && (host_idx[HIGH_QUEUE_IDX_8730EA] == hw_idx[HIGH_QUEUE_IDX_8730EA])) {
			ret = true;
			break;
		}
		_os_delay_us(phl_com->drv_priv, 1);
		i++;
	}

	return ret;
}

static u32 hal_check_bcn_status_8730ea(struct hal_info_t *hal)
{
	u32 status = 0;

	if (hal->txdone_ch_map[0] & BIT_TXBCN1_OK_INT) {
		status |= PHL_P0_TX_BCN_OK;
	}

	if (hal->txdone_ch_map[0] & BIT_TXBCN1_ERR_INT) {
		status |= PHL_P0_TX_BCN_ERR;
	}

	if (hal->txdone_ch_map[2] & BIT_BCNERLY0_INT) {
		status |= PHL_P0_TX_BCN_EARLY;
	}

#ifdef CONFIG_CONCURRENT_MODE
	if (hal->txdone_ch_map[2] & BIT_TXBCNOK9_INT) {
		status |= PHL_P1_TX_BCN_OK;
	}

	if (hal->txdone_ch_map[2] & BIT_TXBCNERR9_INT) {
		status |= PHL_P1_TX_BCN_ERR;
	}

	if (hal->txdone_ch_map[2] & BIT_BCNERLY8_INT) {
		status |= PHL_P1_TX_BCN_EARLY;
	}
#endif

	return status;
}

static bool hal_check_tx_done_8730ea(struct hal_info_t *hal, u8 dma_ch)
{
	bool ret = false;

	switch (dma_ch) {
	case MGT_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_MGNTDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_MGNTDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case VO_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_VODOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_VODOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case VI_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_VIDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_VIDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case BE_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_BEDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_BEDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case BK_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_BKDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_BKDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case HIGH_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_H0DOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_H0DOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case BCN_QUEUE_IDX_8730EA:
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown channel (%d)\n",
			  dma_ch);
		ret = false;
		break;
	}

	return ret;
}

/**
 * the function will deinitializing 8730ea specific data and hw configuration
 */
static void hal_trx_deinit_8730ea(struct hal_info_t *hal)
{
	/*struct rtw_hal_com_t *hal_com = hal->hal_com;*/
}

/**
 * the function will initializing 8730ea specific data and hw configuration
 */
static enum rtw_hal_status hal_trx_init_8730ea(struct hal_info_t *hal, u8 *txbd_buf, u8 *rxbd_buf)
{
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	/* Set AMPDU max agg number to 128 */
	/* CR setting*/
	rtw_hal_mac_set_hw_ampdu_cfg(hal, 0, 0x14, 0xAB);

	_hal_trx_init_bd_8730ea(hal, txbd_buf, rxbd_buf);

	_hal_trx_init_bd_num_8730ea(hal);

	return hstatus;
}

static struct hal_trx_ops ops = {0};
void hal_trx_ops_init_8730ea(void)
{
	ops.init = hal_trx_init_8730ea;
	ops.deinit = hal_trx_deinit_8730ea;
	ops.query_trxring_num = hal_get_trxring_num_8730ea;
	ops.query_tx_res = hal_get_avail_txbd_8730ea;
	ops.query_rx_res = hal_get_avail_rxbd_8730ea;
	ops.cfg_wow_txdma = hal_cfg_wow_txdma_8730ea;
	ops.poll_txdma_idle = hal_poll_txdma_idle_8730ea;
	ops.map_hw_tx_chnl = hal_mapping_hw_tx_chnl_8730ea;
	ops.qsel_to_tid = hal_qsel_to_tid_8730ea;
	ops.query_txch_num = hal_query_txch_num_8730ea;
	ops.query_rxch_num = hal_query_rxch_num_8730ea;
	ops.update_wd = hal_update_wd_8730ea;
	ops.update_txbd = hal_update_txbd_8730ea;
#ifdef RTW_PHL_BCN_IOT
	ops.tx_bcn_start = hal_trigger_bcn_8730ea;
#endif
	ops.tx_start = hal_trigger_txdma_8730ea;
	ops.check_rxrdy = hal_check_rxrdy_8730ea;
	ops.check_bcn_status = hal_check_bcn_status_8730ea;
	ops.check_tx_done = hal_check_tx_done_8730ea;
	ops.handle_rxbd_info = hal_handle_rxbd_info_8730ea;
	ops.handle_rx_buffer = hal_handle_rx_buffer_8730e;
	ops.update_rxbd = hal_update_rxbd_8730ea;
	ops.notify_rxdone = hal_notify_rxdone_8730ea;
}



u32 hal_hook_trx_ops_8730ea(struct rtw_phl_com_t *phl_com,
			    struct hal_info_t *hal_info)
{
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;

	if (NULL != hal_info) {
		hal_trx_ops_init_8730ea();
		hal_info->trx_ops = &ops;
		hstatus = RTW_HAL_STATUS_SUCCESS;
	}

	return hstatus;
}
